Masmiseim36/nxpSDK/devices/MIMXRT106A/drivers/fsl_flexcan.c
    /* Clean Message Buffer content. */
    base->MB[mbIdx].ID    = 0x0;
    base->MB[mbIdx].WORD0 = 0x0;
    base->MB[mbIdx].WORD1 = 0x0;
}

/*!
 * @brief Calculates the segment values for a single bit time for classical CAN
 *
 * @param baudRate The data speed in bps
 * @param tqNum Number of time quantas per bit
 * @param pTimingConfig Pointer to the FlexCAN timing configuration structure.
 *
 */
static void FLEXCAN_GetSegments(uint32_t baudRate, uint32_t tqNum, flexcan_timing_config_t *pTimingConfig)
{
    uint32_t ideal_sp;
    uint32_t p1;

    /* get ideal sample point. */
    if (baudRate >= 1000000U)
    {
        ideal_sp = IDEAL_SP_LOW;
    }
    else if (baudRate >= 800000U)
    {
        ideal_sp = IDEAL_SP_MID;
    }
    else
    {
        ideal_sp = IDEAL_SP_HIGH;
    }

    /* distribute time quanta. */
    p1                       = tqNum * (uint32_t)ideal_sp;
    pTimingConfig->phaseSeg1 = (uint8_t)(p1 / IDEAL_SP_FACTOR - 2U);

    if (pTimingConfig->phaseSeg1 > (MAX_PSEG1 + MAX_PROPSEG))
    {
        pTimingConfig->phaseSeg1 = MAX_PSEG1;
        pTimingConfig->propSeg   = MAX_PROPSEG;
    }
    else if (pTimingConfig->phaseSeg1 > MAX_PSEG1)
    {
        pTimingConfig->propSeg   = pTimingConfig->phaseSeg1 - MAX_PSEG1;
        pTimingConfig->phaseSeg1 = MAX_PSEG1;
    }
    else
    {
        pTimingConfig->propSeg = 0;
    }

    pTimingConfig->phaseSeg2 = (uint8_t)tqNum - (1U + pTimingConfig->phaseSeg1 + 1U + pTimingConfig->propSeg + 1U + 1U);
    assert(pTimingConfig->phaseSeg2 <= MAX_PSEG2);

    /* subtract one TQ for sync seg. */
    /* sjw is 20% of total TQ, rounded to nearest int. */
    pTimingConfig->rJumpwidth = ((uint8_t)tqNum + (5U - 1U)) / 5U - 1U;
    if (pTimingConfig->rJumpwidth > MAX_RJW)
    {
        pTimingConfig->rJumpwidth = MAX_RJW;
    }
}

/*!
 * @brief Calculates the improved timing values by specific baudrates for classical CAN
 *
 * @param baudRate  The classical CAN speed in bps defined by user
 * @param sourceClock_Hz The Source clock data speed in bps. Zero to disable baudrate switching
 * @param pTimingConfig Pointer to the FlexCAN timing configuration structure.
 *
 * @return TRUE if timing configuration found, FALSE if failed to find configuration
 */
bool FLEXCAN_CalculateImprovedTimingValues(uint32_t baudRate,
                                           uint32_t sourceClock_Hz,
                                           flexcan_timing_config_t *pTimingConfig)
{
    /* observe baud rate maximums. */
    assert(baudRate <= MAX_CAN_BAUDRATE);

    uint32_t clk;   /* the clock is tqNumb x baudRateFD. */
    uint32_t clk2;  /* the clock2 is clk2 / Pre-scaler Division Factor. */
    uint32_t tqNum; /* Numbers of TQ. */
    bool fgRet = false;

    /*  Auto Improved Protocal timing for CBT. */
    tqNum = CTRL1_MAX_TIME_QUANTA;
    do
    {
        clk = baudRate * tqNum;
        if (clk > sourceClock_Hz)
        {
            continue; /* tqNum too large, clk has been exceed sourceClock_Hz. */
        }

        if (clk < sourceClock_Hz)
        {
            break; /* Non-supporting: the frequency of clock source is not divisible by target baud rate, the user
                      should change a divisible baud rate. */
        }

        for (pTimingConfig->preDivider = 0x00; pTimingConfig->preDivider <= MAX_PRESDIV; (pTimingConfig->preDivider)++)
        {
            /* Consider some proessor not contain FPU, the parameter need to be exact division. */
            if ((clk / ((uint32_t)(pTimingConfig->preDivider) + 1U) * ((uint32_t)(pTimingConfig->preDivider) + 1U)) !=
                clk)
            {
                continue; /* clk need to be exact division by preDivider + 1. */
            }
            clk2 = clk / ((uint32_t)(pTimingConfig->preDivider) + 1U);
            if (((sourceClock_Hz / clk2) * clk2) != sourceClock_Hz)
            {
                continue; /* sourceClock_Hz need to be exact division by preDivider. */
            }

            /* Get the best timing configuration. */
            FLEXCAN_GetSegments(baudRate, tqNum, pTimingConfig);
            fgRet = true;
            break;
        }
        if (fgRet)
        {
            break;
        }
    } while (--tqNum >= CTRL1_MIN_TIME_QUANTA);

    return fgRet;
}

#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
static uint32_t FLEXCAN_GetFDMailboxOffset(CAN_Type *base, uint8_t mbIdx)
{
    uint32_t offset   = 0;
    uint32_t dataSize = (base->FDCTRL & CAN_FDCTRL_MBDSR0_MASK) >> CAN_FDCTRL_MBDSR0_SHIFT;
    switch (dataSize)
    {
        case (uint32_t)kFLEXCAN_8BperMB:
            offset = (((uint32_t)mbIdx / 32U) * 512U + ((uint32_t)mbIdx % 32U) * 16U);
            break;
        case (uint32_t)kFLEXCAN_16BperMB:
            offset = (((uint32_t)mbIdx / 21U) * 512U + ((uint32_t)mbIdx % 21U) * 24U);
            break;
        case (uint32_t)kFLEXCAN_32BperMB:
            offset = (((uint32_t)mbIdx / 12U) * 512U + ((uint32_t)mbIdx % 12U) * 40U);
            break;
        case (uint32_t)kFLEXCAN_64BperMB:
            offset = (((uint32_t)mbIdx / 7U) * 512U + ((uint32_t)mbIdx % 7U) * 72U);
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }
    /* To get the dword aligned offset, need to divide by 4. */
    offset = offset / 4U;
    return offset;
}

/*!
 * @brief Calculates the segment values for a single bit time for CANFD bus control baud Rate
 *
 * @param baudRate The canfd bus control speed in bps
 * @param tqNum Number of time quanta per bit
 * @param pTimingConfig Pointer to the FlexCAN timing configuration structure.
 *
 */
static void FLEXCAN_FDGetSegments(uint32_t baudRate, uint32_t tqNum, flexcan_timing_config_t *pTimingConfig)
{
    uint32_t ideal_sp;
    uint32_t p1;

    /* get ideal sample point. */
    if (baudRate >= 1000000U)
    {
        ideal_sp = IDEAL_SP_LOW;
    }
    else if (baudRate >= 800000U)
    {
        ideal_sp = IDEAL_SP_MID;
    }
    else
    {
        ideal_sp = IDEAL_SP_HIGH;
    }

    /* distribute time quanta. */
    p1                       = tqNum * (uint32_t)ideal_sp;
    pTimingConfig->phaseSeg1 = (uint8_t)(p1 / (uint32_t)IDEAL_SP_FACTOR - 2U);
    if (pTimingConfig->phaseSeg1 > (MAX_EPSEG1 + MAX_EPROPSEG))
    {
        pTimingConfig->phaseSeg1 = MAX_EPSEG1;
        pTimingConfig->propSeg   = MAX_EPROPSEG;
    }
    else if (pTimingConfig->phaseSeg1 > MAX_EPSEG1)
    {
        pTimingConfig->propSeg   = pTimingConfig->phaseSeg1 - MAX_EPSEG1;
        pTimingConfig->phaseSeg1 = MAX_EPSEG1;
    }
    else
    {
        pTimingConfig->propSeg = 0;
    }

    pTimingConfig->phaseSeg2 = (uint8_t)tqNum - (1U + pTimingConfig->phaseSeg1 + 1U + pTimingConfig->propSeg + 1U + 1U);
    assert(pTimingConfig->phaseSeg2 <= MAX_EPSEG2);

    /* subtract one TQ for sync seg. */
    /* sjw is 20% of total TQ, rounded to nearest int. */
    pTimingConfig->rJumpwidth = ((uint8_t)tqNum + (5U - 1U)) / 5U - 1U;
    /* the max tqNum for CBT will reach to 129, ERJW would not larger than 26. */
    /* Consider and max ERJW is 31, so rJumpwidth will always smaller than MAX_ERJW. */
    assert(pTimingConfig->rJumpwidth <= MAX_ERJW);
}

/*!
 * @brief Calculates the segment values for a single bit time for CANFD bus data baud Rate
 *
 * @param baudRatebrs The canfd bus data speed in bps
 * @param tqNum Number of time quanta per bit
 * @param pTimingConfig Pointer to the FlexCAN timing configuration structure.
 *
 */
static void FLEXCAN_FDGetSegmentswithBRS(uint32_t baudRatebrs, uint32_t tqNum, flexcan_timing_config_t *pTimingConfig)
{
    uint32_t ideal_sp;
    uint32_t p1;

    /* get ideal sample point. */
    if (baudRatebrs >= 1000000U)
    {
        ideal_sp = IDEAL_SP_LOW;
    }
    else if (baudRatebrs >= 800000U)
    {
        ideal_sp = IDEAL_SP_MID;
    }
    else
    {
        ideal_sp = IDEAL_SP_HIGH;
    }

    /* distribute time quanta. */
    p1                        = tqNum * (uint32_t)ideal_sp;
    pTimingConfig->fphaseSeg1 = (uint8_t)(p1 / (uint32_t)IDEAL_SP_FACTOR - 1U);
    if (pTimingConfig->fphaseSeg1 > (MAX_FPSEG1 + MAX_FPROPSEG))
    {
        pTimingConfig->fphaseSeg1 = MAX_FPSEG1;
        pTimingConfig->fpropSeg   = MAX_FPROPSEG;
    }
    else if (pTimingConfig->fphaseSeg1 > MAX_FPSEG1)
    {
        pTimingConfig->fpropSeg   = pTimingConfig->fphaseSeg1 - MAX_FPSEG1;
        pTimingConfig->fphaseSeg1 = MAX_FPSEG1;
    }
    else
    {
        pTimingConfig->fpropSeg = 0;
    }

    pTimingConfig->fphaseSeg2 =
        (uint8_t)tqNum - (1U + pTimingConfig->fphaseSeg1 + 1U + pTimingConfig->fpropSeg + 0U + 1U);

